#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/KrisCo/Lab-production/runs/run-U5XkWyrefCMMsHXH

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_vpc.lab: Refreshing state... [id=vpc-06fa7810749afdd8e]
aws_subnet.lab-public-0: Refreshing state... [id=subnet-0a6828a7f4bfebff3]
aws_subnet.lab-public-1: Refreshing state... [id=subnet-0de27d08239b1ee9e]
aws_internet_gateway.lab: Refreshing state... [id=igw-0a750b989bf78675e]
aws_security_group.lab: Refreshing state... [id=sg-0b1a1ed6d59f5ffa8]
aws_subnet.lab-public-2: Refreshing state... [id=subnet-038819f3e4e3e5238]
aws_lb_target_group.alb_target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414181040531100000001/b9a1a20b4c03f312]
aws_route_table.lab: Refreshing state... [id=rtb-013f6414af3fc8b56]
aws_instance.EC2-2: Refreshing state... [id=i-02b19e434b5d3ef26]
aws_instance.EC2-0: Refreshing state... [id=i-0021c3d450cad91ed]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:loadbalancer/app/production-alb/a0169b188358ffee]
aws_instance.EC2-1: Refreshing state... [id=i-0c0588ba305a8125c]
aws_route_table_association.public-access-1: Refreshing state... [id=rtbassoc-052896406f6c667b7]
aws_route_table_association.public-access-2: Refreshing state... [id=rtbassoc-0af92644acf1f75bf]
aws_route_table_association.public-access-0: Refreshing state... [id=rtbassoc-0920dfd7dbd491a81]
aws_lb_listener.alb_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:listener/app/production-alb/a0169b188358ffee/ccd6e259fc3755cc]
aws_lb_target_group_attachment.lab-0: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414181040531100000001/b9a1a20b4c03f312-20230414192254749400000004]
aws_lb_target_group_attachment.lab-2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414181040531100000001/b9a1a20b4c03f312-20230414192306556800000006]
aws_lb_target_group_attachment.lab-1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414181040531100000001/b9a1a20b4c03f312-20230414192254835600000005]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.EC2-0 must be replaced
-/+ resource "aws_instance" "EC2-0" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-0021c3d450cad91ed" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0021c3d450cad91ed" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-04825d7db2b81aa52" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-207.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.207" -> (known after apply)
      ~ public_dns                           = "ec2-52-90-115-195.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "52.90.115.195" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0b1a1ed6d59f5ffa8",
        ]
        tags                                 = {
            "Name" = "EC2-production-0"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "9bb80119ab85de27e43e50001145c2b2d2626ce1" -> "8d3b27db58b38e59fb0ef6e10847a3431cd16bbe"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0b1a1ed6d59f5ffa8",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0a4374968dcda829e" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.EC2-1 must be replaced
-/+ resource "aws_instance" "EC2-1" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-0c0588ba305a8125c" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0c0588ba305a8125c" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-068c7f6872ac177e2" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-13.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.13" -> (known after apply)
      ~ public_dns                           = "ec2-54-89-160-176.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.89.160.176" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0b1a1ed6d59f5ffa8",
        ]
        tags                                 = {
            "Name" = "EC2-production-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "9bb80119ab85de27e43e50001145c2b2d2626ce1" -> "8d3b27db58b38e59fb0ef6e10847a3431cd16bbe"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0b1a1ed6d59f5ffa8",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0e0ae7597143cfc63" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.EC2-2 must be replaced
-/+ resource "aws_instance" "EC2-2" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:949471431711:instance/i-02b19e434b5d3ef26" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-east-1c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-02b19e434b5d3ef26" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-033e4e650f35da808" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-140.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.140" -> (known after apply)
      ~ public_dns                           = "ec2-184-73-83-52.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "184.73.83.52" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0b1a1ed6d59f5ffa8",
        ]
        tags                                 = {
            "Name" = "EC2-production-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "9bb80119ab85de27e43e50001145c2b2d2626ce1" -> "8d3b27db58b38e59fb0ef6e10847a3431cd16bbe"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0b1a1ed6d59f5ffa8",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-08cc4a04e9814033d" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_lb_target_group_attachment.lab-0 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-0" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414181040531100000001/b9a1a20b4c03f312-20230414192254749400000004" -> (known after apply)
      ~ target_id        = "i-0021c3d450cad91ed" # forces replacement -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-1 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414181040531100000001/b9a1a20b4c03f312-20230414192254835600000005" -> (known after apply)
      ~ target_id        = "i-0c0588ba305a8125c" # forces replacement -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.lab-2 must be replaced
-/+ resource "aws_lb_target_group_attachment" "lab-2" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:949471431711:targetgroup/my-tg20230414181040531100000001/b9a1a20b4c03f312-20230414192306556800000006" -> (known after apply)
      ~ target_id        = "i-02b19e434b5d3ef26" # forces replacement -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.


```

</details>

*Pushed by: @krispigeau, Action: `pull_request`*